In [4]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv("airlines.csv")
df.head(11)

,Airline ID,Name,Alias,IATA,ICAO,Callsign,Country,Active
0,-1,Unknown,\N,-,NaN,\N,\N,Y
1,1,Private flight,\N,-,NaN,NaN,NaN,Y
2,2,135 Airways,\N,NaN,GNL,GENERAL,United States,N
3,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
4,4,2 Sqn No 1 Elementary Flying Training School,\N,NaN,WYT,NaN,United Kingdom,N
5,5,213 Flight Unit,\N,NaN,TFU,NaN,Russia,N
6,6,223 Flight Unit State Airline,\N,NaN,CHD,CHKALOVSK-AVIA,Russia,N
7,7,224th Flight Unit,\N,NaN,TTF,CARGO UNIT,Russia,N
8,8,247 Jet Ltd,\N,NaN,TWF,CLOUD RUNNER,United Kingdom,N
9,9,3D Aviation,\N,NaN,SEC,SECUREX,United States,N
10,10,40-Mile Air,\N,Q5,MLA,MILE-AIR,United States,Y

Informacion General

In [6]:
df.info

<bound method DataFrame.info of       Airline ID                                          Name  \
0             -1                                       Unknown
1              1                                Private flight
2              2                                   135 Airways
3              3                                 1Time Airline
4              4  2 Sqn No 1 Elementary Flying Training School
...          ...                                           ...
6157       21248                                   GX Airlines
6158       21251                        Lynx Aviation (L3/SSX)
6159       21268                               Jetgo Australia
6160       21270                                  Air Carnival
6161       21317                                 Svyaz Rossiya

                  Alias IATA ICAO         Callsign         Country Active
0                    \N    -  NaN               \N              \N      Y
1                    \N    -  NaN              NaN             NaN      Y
2                    \N  NaN  GNL          GENERAL   United States      N
3                    \N   1T  RNX          NEXTIME    South Africa      Y
4                    \N  NaN  WYT              NaN  United Kingdom      N
...                 ...  ...  ...              ...             ...    ...
6157                NaN  NaN  CBG            SPRAY           China      Y
6158                NaN  NaN  SSX           Shasta   United States      N
6159                NaN   JG   \N              NaN       Australia      Y
6160                NaN   2S   \N              NaN           India      Y
6161  Russian Commuter    7R  SJM  RussianConnecty          Russia      Y

[6162 rows x 8 columns]>

In [7]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Airline ID,6162.0,4152.723304,4507.307094,-1.0,1541.25,3082.5,4628.75,21317.0

Buscar Valores Nulos

In [8]:
df.isnull().sum()

Airline ID       0
Name             0
Alias          506
IATA          4627
ICAO            87
Callsign       808
Country         15
Active           0
dtype: int64

In [9]:
df.isnull().sum()/len(df) * 100

Airline ID     0.000000
Name           0.000000
Alias          8.211620
IATA          75.089257
ICAO           1.411879
Callsign      13.112626
Country        0.243427
Active         0.000000
dtype: float64

Eliminar Duplicados

In [10]:
print("Duplicados Antes", df.duplicated().sum())

df = df.drop_duplicates()

print("Duplicados Después", df.duplicated().sum())

Duplicados Antes 0
Duplicados Después 0

Detectarb columnas numericas y categorias

In [11]:
numeric_cols = df.select_dtypes(include=['number']).columns
categorical_cols = df.select_dtypes(include=['object']).columns

print("Columnas Numéricas:", list(numeric_cols))
print("Columnas Categóricas:", list(categorical_cols))

Columnas Numéricas: ['Airline ID']
Columnas Categóricas: ['Name', 'Alias', 'IATA', 'ICAO', 'Callsign', 'Country', 'Active']

conversion de fechas

In [12]:
for col in df.columns:
    if "date" in col.lower() or "time" in col.lower():
        df[col] = pd.to_datetime(df[col], errors='coerce')

    df.head()

Eliminar nulos

In [13]:
df = df.dropna()
df.isnull().sum()
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1010 entries, 3 to 6161
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Airline ID  1010 non-null   int64
 1   Name        1010 non-null   object
 2   Alias       1010 non-null   object
 3   IATA        1010 non-null   object
 4   ICAO        1010 non-null   object
 5   Callsign    1010 non-null   object
 6   Country     1010 non-null   object
 7   Active      1010 non-null   object
dtypes: int64(1), object(7)
memory usage: 71.0+ KB